[
  "Weekly Entering & Transitioning - Thread 20 Feb, 2023 - 27 Feb, 2023",
  "PyGWalker: Turn your Pandas Dataframe into a Tableau-style UI for Visual Analysis",
  "There are too many charlatans on Linkedin posing as Data Scientist. Gone through his profile, not a single mention of his work. Most of the posts are engagement farming. The awards also seems to be suspicious and paid. My main question is who should you follow for quality content ?",
  "Is NLP a sub-field with a lot of growth?",
  "What is the best resource to understand intuitively the PDF of the Poisson and Exponential Distributions?",
  "I built a \"clone\" of the New Bing - I appreciate any feedback",
  "Is it normal in the data Science field to not have that many code checks?",
  "What Master's program did you do and how has it helped your DS career specifically?",
  "Website to quickly SQL a CSV: feedback?",
  "Python Pandas: Best way to organize DataFrames with Series that vary in dimensionality?",
  "Got an offer that doubles my salary but I am not interested…still accept?",
  "I invented a new abstraction for data viz. After nearly 2 years of work, I'm sharing Vizpipe here for the first time",
  "Sharing big NumPy arrays across python processes",
  "Question - email marketing feature",
  "Best Python Libraries for Data Visualization and Dashboard Creation",
  "Imp Q regarding Machine Learning Engineer",
  "Taken data from a website's API - Now what?",
  "John Cena as a spiderverse character using Img2img and Control net Depth",
  "Do you need a portfolio if you already have ~3 years of experience on the field?",
  "Who would you rather train in data stewardship?",
  "NeuralNextG v0.1.0: Analyzing Rocket League games automatically with Machine Learning",
  "DataOps Usecases for Insurance Industry",
  "Is it standard for data scientists to work solely on cloud computing platforms like GCP?",
  "Real-Time-Object-Counting-on-Jetson-Nano",
  "Buzz around new Deep Learning Models and Incorrect Usage of them.",
  "Regression and Time Series",
  "Anyone enter the field in 2021 or after without grad school? What were your experiences?",
  "Deploy Machine Learning Models with Django",
  "Go for internship, new grad, or mid level career?",
  "Would community-owned data centers help with the sovereignty of data?",
  "How to improve my coding level",
  "Tracers, IDI, Enformion, PIPL, etc -- How do these companies obtain their data?",
  "Have you ever had the opportunity to Travel with a Data Science Role?",
  "Laptop Recommendation",
  "Should I jump ship after just 2 months?",
  "Why is Python so used in data science?",
  "Where can I find researches, articles, or academic papers on how companies make use of data science?",
  "What tool and framework are you currently using in your data process?",
  "How to transform monthly panel data into annual panel data?",
  "Do you want an easy and quick way to explain your image models?",
  "What are the most fun parts of your work in DS?",
  "Collaborating with data scientists in your team",
  "What machine learning tools have you thought about purchasing/paying for, but just haven't done yet?",
  "Pros and cons of direct hire vs contract to hire data science positions",
  "Applied for OMSA program, but this thread is making me nervous for a data science career. Thoughts?",
  "Best way to make a random forest more explainable (need to know which features are driving the prediction)",
  "Realistically, what skills do I need to land a Data Analyst internship?",
  "I need a DL mentor",
  "Anyone open to be Data Science mentor?",
  "Real-Time-Object-Counting-by-Jetson-Nano",
  "Mac Mini M2 vs M2 Pro for Data Science",
  "Brain Tumor Detection Web Application using Transfer Learning: An End-To-End Project",
  "Working with Prophet",
  "i got a 68% on my Calculus exam and 75% on my Python exam at University. what grade matters more? which one of them should i retake if the resit exams is on the same day?",
  "Hey Newbie here!",
  "Europe data salary benchmark 2023",
  "Why is it so hard to get internships?",
  "Data scientists in Los Angeles..",
  "Google's Response To OpenAI and ChatGPT is Coming, And They've Named It...",
  "Data scientists in dubai",
  "DS Problem: Hidden Business",
  "Case studies for my team.",
  "Can you suggest me a method for selecting representative data?",
  "Question about drift",
  "General Question on Scraping Websites and Data Cleaning",
  "Here’s a playlist of 7 hours of music with NO VOCALS I use to focus when I’m coding /learning . Post yours as well if you also have one!",
  "Site like r4ds but for Python",
  "How's the data science job market in the UK?",
  "Big data in list of vectors or in dataframe (R)",
  "Data Scientists only want one thing and it's fucking disgusting..",
  "Do you ever feel like your work is pointless?",
  "Feasibility of using no code / low code platforms such as KNIME and DataIku for social science research",
  "\"Sorry, this post has been removed by the moderators of r/datascience\" Does anyone know why so many posts here are deleted by the mods or does it happen automatically? I don't think any rule has been violated. I also sent a direct message to the mods but never received a reply.",
  "How to incorporate a data analytics task to a implementations specialist job?",
  "What are the three main challenges in machine learning?",
  "Chessalytics: Analyzing my chess games to better understand my play style",
  "What do data science projects look like?",
  "Identifying significance of variables",
  "Overheard: Strangers Discussing AI in Public",
  "Guidance regarding Python practice for Data Science or Machine Learning",
  "Reference for guiding model selection",
  "Using ML or data science approach to aid A/B testing process",
  "What is something ChatGPT (or any LLM) could do, that it can’t currently, that would actually worry you about the future of data science?",
  "Losing hope and direction in trying to find a new position",
  "Difficulty Finding Work Post Layoff",
  "Advice for a Solo Data Scientist at a big co",
  "Probability and Statistics for Data Science - amazing free book (not the buzz book you imagine)",
  "The Table Feature Transformation Library Release",
  "Can i work locally with a virtual environment while ssh'ed to google colab",
  "Why are managers who have never been software engineers or data scientists in charge of teams of software engineers/data scientists?",
  "How to detect data drift in multivariate time series data",
  "I am worried about the future of working as a Data Scientist in industry",
  "RStudio drawbacks for learning and using Python?",
  "Correlation and P-value",
  "Looking for a new team member - strong in statistics - we have already created a Trading Bot for multiple markets",
  "Data Scientist: anyone had similar pov and overcome it? If so how?",
  "Open-source framework to build Web Apps in Jupyter Notebook with Python only",
  "How do I gain experience in AWS and SQL?",
  "From Academia to Data Science: How to efficiently",
  "Looking for guidance from data science professionals",
  "Regression and missing values",
  "Does anyone know of hierarchical-esque topic modeling approaches in NLP?",
  "Pre-processing",
  "Options of bad communicators in data science",
  "After studying a new tool or library, how do you make sure that you've understood it well and will be to use it well as per the requirements?",
  "What are some interview questions that have caught you off-gaurd?",
  "How to work well with others? (Going from role where I was lone wolf and did everything, to one where I will be leading a small team: excited and nervous). Advice?",
  "What is a Semantic Layer?",
  "What do you do when you think your skip level manager is the biggest issue you face?",
  "Packages for mapping distance to a point using address data",
  "predictive maintenance without failure data?",
  "Best practices for very complex dashboard maintenance?",
  "Address Weather API",
  "What is the best way to share lots of files taking up gigabytes of space with other team members?",
  "6 Months in First Data Science Job",
  "you're an angel!!",
  "Forecasting product what is the best practice queation",
  "Job Hunting Tip: Practice Interviewing with ChatGPT",
  "Is it a mistake to enter DS through low-maturity Data Analytics?",
  "Interview Query Subscription",
  "Forecasting model questions",
  "Hello everyone my name is Kenny and am a beginner in data analysis and am new to Reddit Data science community",
  "#NLP Text classification using NER, SRL, keywords",
  "How do I solve the error *AttributeError: 'NoneType' object has no attribute 'astype'*?",
  "is this a good DSA course?",
  "Collecting company financial data in a developing country. Where do the free APIs like yahoo finance get their data?",
  "First data projects",
  "I am new to data science, i just did my betch on CS what skills should I have to do ms on data science",
  "Which online certificate course or online MS in data-science",
  "HELPPPP! What is a data dictionary? And how do we use it for a documentation portfolio",
  "Ghost papers provided by ChatGPT",
  "NMF for a user/product matrix",
  "What role does Tableau and Power BI play in your analysis?",
  "Train ML Models cheap",
  "Do you use tools for automatic EDA? Which ones? Why?",
  "Leetcode for DS",
  "Deciding on Predictors for Logistic Regression",
  "Optimizing model points of a life insurance portfolio",
  "AWS data wrangler alternatives?",
  "Setting up a databricks ci/cd pipeline with github actions - executing code on databricks cluster vs github VM",
  "Question Answering On Domain Knowledge With Semantic Search And Text Generation",
  "Language Questions",
  "AI as a service might be the next thing .",
  "Strange ChatGPT Response",
  "DS interviews (case study)",
  "Going into cancer research in data science",
  "Training / Accreditation in Data Science - best start?",
  "Logical/Analytical tests, ACE/MPA",
  "Zero to Hero: Exploiting Null Effects to Achieve Variance Reduction in Experiments with One-sided Triggering",
  "How to move up in the industry?",
  "Ideas for a YouTube channel",
  "Why is PCR recommended much more often than PLS for dimension reduction?",
  "What do you use to manage your Python packages and environments? Do you prefer Conda or something like virtualenv + pip?",
  "Interesting SQL Interview Question",
  "I’m just getting into Data Science and I need a mentor to guide me through my early career and hold me accountable",
  "With the rise of LLMs like ChatGPT, how will demand for data scientists change?",
  "Tried to resign but my boss talked me out of it",
  "Learning from Machine Learning | Maarten Grootendorst: BERTopic, Data Science, Psychology",
  "What to spend $1000 training budget on",
  "Which one should I get?",
  "[Network Science Related] How much percentage of the actual network nodes (and its corresponding links) need to be in the data in order to \"properly\" describe the network?",
  "Help me in getting a Dataquest subscription and transitioning to a new career.",
  "Re-entering DS after a hiatus",
  "Need help with handling NaN values in rental price prediction project",
  "Is it possible to load and use a pytorch model (.pth) without knowing the model class?",
  "Sentence transformers (BERTopic) on a Macbook Air",
  "Southwest Airline",
  "What is the best way to build a web app",
  "What would you change about the culture in Datascience?",
  "Reverse causality (reverse causation): an important concept when analyzing time series data",
  "Nested Subject Classes",
  "sklearn - cross_val_predict VS cross_val_score?",
  "GeoSpatial Analysis Using GeoPandas In Python",
  "Model Madness Bracket Challenge",
  "What are You do if your dataset have 50 columns?",
  "Senior data scientist, 8yrs experience in deep learning + MS Electrical Engr... What's next?",
  "Weekly Entering & Transitioning - Thread 13 Feb, 2023 - 20 Feb, 2023",
  "I am plotting my result, and the surface plot look really off. I know I am plotting right just its shape is not the best for clearness in 3D. Should I rotate or something or just use a heatmap instead of a surface plot?",
  "Model interpretation with many features",
  "How to ethically/ legally showcase previous professional projects on portfolio?",
  "Data science certificates",
  "New college-grad looking to enter the field. Should I start with Data analytics or Data science?",
  "Intro to PyTorch 2: Convolutional Neural Networks",
  "Get Consistent Stylized Results with the Stable Diffusion Img2Img Webu",
  "Data Challenges: Insights for new data scientist",
  "How important is networking (From a junior prespective)?",
  "Where does data come from?",
  "Fun Post- Kind of Sampling would have been used in Infinity War.",
  "School",
  "Calling all NLP gurus, Meta is paying top dollar 😂",
  "college student seeking insight in data sci career",
  "I dont have a strong computer, so want to build a cloud(any provider) instance as shown in the image. Dont have money to subscribe AI ML services. please help me",
  "Is it difficult to compete for data science jobs right now?",
  "Has anyone taken Avery Smith's Data Career Jumpstart Program?",
  "Advice",
  "standard Expectations for Machine Learning engineer?",
  "8 Best Microsoft Azure Consulting Companies in 2023",
  "Shifting from mechanical to data science",
  "Amazing data science work. way to reduce dimensionality for superior real time performance tracking.",
  "Career shift help",
  "From Market Research/Insights role to Data Analyst? Looking for advice",
  "Coursera- PG diploma in Applied Statistics by ISI",
  "New To DS - LF Advice",
  "Insight from data scientists - especially ex data engineers",
  "OneFlow v0.9.0 Came Out!",
  "Advice request: How to find a subject?",
  "Logistic Regression- Help Please",
  "Dataset Suggestions",
  "Difficulties consuming AI API vendors like AWS Rekognition",
  "Energy load forecasting - advice please!",
  "Coursera- PG diploma in Applied Statistics by ISI",
  "Is Matrix Factorization a proper approach this use case?",
  "What are the most important skills to have as a data engineer?",
  "Should I apply for Power BI Developer positions?",
  "SAS Issues-HELP",
  "Low ranked Data Science MS vs High ranked (UC) Business Analytics?",
  "Guide me ! Business, Studies, life",
  "Does it look bad to work on a project for a long time?",
  "Starting out in Data Engineering: Seeking guidance and resources",
  "How can I normalize time series data following a sin(x)+x shape to a sin(x) shape",
  "I have a Masters in Data Science but I feel behind on some basics. Should I go back to school to pick up the math and stats I think I’m missing?",
  "How many Linkedin Weekly Connect Requests do you get on average?",
  "Data Science Courses <help needed>",
  "Dataset/model for \"potential\" fraud detection, scammy news / fake news.",
  "Suggestions for an ‘Advanced Database Management’ class project?",
  "How do you know DS is NOT for you?",
  "Reccomendations to keep track of learning",
  "How to use 6 month to become a better specialist and get paid more?",
  "R and python in university",
  "where to start learning in data science road map",
  "What to expect from day-long dataset interview?",
  "For those who interview folks for prospective data science roles. What is the most common reason people don’t move forward in the interview process?",
  "[Question] Percentage Represented as Circles ?",
  "How to collaborate with the business stakeholders for ML projects?",
  "Start with EDA or a model",
  "Small win, needed this",
  "not a good fit",
  "Currently in undergrad and need advice on a masters program.",
  "Data Science Undergrad Deciding Between Regression Analysis and ML",
  "Teach Yourself Programming in Ten Years",
  "Big data is dead- Zerodha, CEO.",
  "[question] photos ORIGINAL metadata info",
  "How to present a Jupiter Notebook to a non-technical stakeholder?",
  "Thoughts?",
  "How to learn to deal with data that has high dimensionality",
  "How to Create a Basic AI ChatBot using Python in 5 Minutes?",
  "your qualifications",
  "[question] photo’s original metadata [oco]",
  "Instagram API to Google Spreadsheets: How to program yourself?",
  "Best Courses/ Resources To Learn NLP From Basics ?",
  "MidJourney New Features (Blend, Niji) tutorial",
  "Data engineering vs data science",
  "fully remote DS job exists?",
  "How much of a threat to data science/scientists is AI",
  "Deforum video Input Tutorial",
  "What was your best interview experience?",
  "not creating content",
  "Any Online PhD Program Recommendations ?",
  "Salary requirement",
  "Which language/method to use",
  "Blatant Hypocrisy or not?",
  "Data Analyst vs System and Cybersecurity Analyst which one is the best job?",
  "How to find a mentor?",
  "Advice on data governance tools",
  "Beyond Transformers 🤖 with a neuro-symbolic framework!",
  "How do you present non-quantifiable business value?",
  "Predicting the Perfect Media Mix with AutoML Library Pycaret",
  "advise",
  "LSTM Advice.",
  "Discrimination in AI, Machine Learning, and Datasets",
  "Take Home Skills Evaluation for Data Scientist Position (Create Production Library) ?",
  "I'm throwing in the towel, nested dictionary to dataframe help please!",
  "Freelance data analysts, how much are you charging per hour?",
  "Thoughts?",
  "How much math is really needed for a beginner in data science",
  "Hey I have question How can I plot whole year data for each day I don't want to aggregate it in month level I want it in day level",
  "Some very cool e2e ML projects by KTH Students",
  "suggestions on BA thesis topic in Economics and Data Science/ML",
  "What information is gained in a decision tree algorithm?",
  "Any data scientists in industry using functional data analysis (FDA) methods?",
  "I need career advice please!",
  "Should I compromise on a conservative workplace?",
  "Where do I start as a HS student?",
  "Carpentry career to data science?",
  "Seeking best software for decision making chart",
  "What UI tools do you use to explore a data set?",
  "Quitting my job before having another one lined up.",
  "SVM is good for dealing with dependent variable with more than 1 margin. But what if only 1 out of the many variables has multiple margin?",
  "Am I on the right track?",
  "The Kaggle Book : Book by Konrad Banachewicz and Luca Massaron",
  "Boost Your Data Science Career with Advanced ML Skills",
  "Help for Assignment",
  "Exporting average rgb values from a small area in a .mov frame by frame into a table",
  "Match making problem with only positive data",
  "Confidence in my approach.",
  "Should i choose Data engineering internship",
  "Substance abuse and alcohol datasets",
  "What is AI Interpretability & Explainability",
  "Choosing job title: Data science / engineering specialist?",
  "Using API for bulk data - Can someone explain it like I'm a 7 years old?",
  "Is Medium worth it?",
  "[Noob question] Why are notebooks not used in production ?",
  "Steps to data science",
  "applying NLP",
  "Salary Bump from Senior to Lead DS Feels Small",
  "Volunteer in London",
  "Job likelihood after bootcamp vs bachelor/masters?",
  "Finding Geospatial Data Scientists for Contract Jobs? Any sites out there?",
  "Should I go to this programming analyst job interview? Would Appreciate some Guidance",
  "some question about portfolio projects.",
  "Anyone have valentine meme/puns related to data or tech? I'm looking for a funny or creative one!!",
  "How can I check the statistical datatypes of all columns en masse?",
  "What did the interview for your current role consist of? Were you given LeetCode style questions?",
  "I have a list of 177 companies that I need to gather 2022-2021 revenue numbers for and I don’t want to do it 1 by 1. Is there an application that exists where I can just plug in all those companies and it’ll spit the numbers back out at me? Or a script of some sort?",
  "Classification Techniques for Extrapolation?",
  "Learning Path for a High Schooler",
  "Any Canadians (living in Canada) have luck landing a remote job based in the US?",
  "Project: Transcribing millions of images into handwriting and making it fast and cheap",
  "Find Kth Smallest Element, FAANG Interview Problem",
  "Review on a Notebook",
  "A simpler option for a portfolio website.",
  "Am I making a mistake doing a PhD at the same school as my undergrad?",
  "Data Science for Finance Jobs",
  "Should I take a Data Engineer job?",
  "Datasets",
  "Interview questions for an intern",
  "Interview - Which models to compare LightGBM with?",
  "Lie through the hiring process?",
  "A bit of guidance?",
  "Applications of Data Science in Education",
  "How to deal with randomness (e.g., sampling) when evaluating models",
  "Which is the best way to encode my data",
  "JP Morgan AI & Data Science, How was Your Internship?",
  "Is high end data visualization considered data science or is it more data science adjacent?",
  "Advice on becoming a data analyst/scientist with an Econ degree?",
  "Any Eu hiring manager interested in private consulting?",
  "Your Favorite websites/newsletters for great articles and news",
  "Do I need a Master’s",
  "Data Manipulation with Excel",
  "Give end users access to big data",
  "First data science college internship interview!",
  "Data Scientist Salary Discussion UK/Ireland",
  "What should I do? Help!!",
  "Honest Tutort Academy Review",
  "TEXTure: Text to 3D textures",
  "How to ask for clarification that confidential documents were given due diligence?",
  "Best way to open source a my dataset?",
  "Hey guys I am from India, I don't have a degree in stats or CS, I am doing a kinda bootcamp course for data science. I want to get a job in US or Europe. Do you think it's a good move or that I have any chance of getting a job(do you know employer who sponsors visa). Any advice is welcome. THANKS!",
  "A work problem involving data",
  "How to select appropriate aggregations",
  "Getting started as data analyst eventually working towards Data scientist",
  "What are the standard practices for data in a Github project repository?",
  "Anyone here work in consulting?",
  "Any experience with Dataiku?",
  "Open source MLOps",
  "What are your personal favourite ML courses?",
  "Did I just waste my time with this project?",
  "What is the key difference between data science and artificial intelligence?",
  "Where do you post&discuss about possible data analysis projects?",
  "need edu/career guidance (entry/prep for DE)",
  "Interview Prep question: Finance sector",
  "Help!! unable to install \"\"python -m spacy download en_core_web_sm\"\" on my laptop",
  "Long Term Prospect for Data Science Given AI Advancements",
  "Alternatives to Sentiment Analysis and Topic Modelling",
  "I'm the only \"data scientist\" at my company and have lost all motivation and want to leave but feel bad. Any advice?",
  "Company contract",
  "Please give me your two cents on the online MS program",
  "I've lost the spark",
  "Read Raster Data From Postgis Using Python",
  "What should I do my post-graduate studies in?",
  "I need help interpreting this graph's percentages",
  "Using Computer Vision To Destroy a Childhood High Score in a DS Game",
  "Understand coding and logic but hate the software development process (debugging, optimization etc) and coding for the sake of coding. Can I still pursue data science?",
  "Is MacBook Pro 14 M1Pro still worth it?",
  "Research paper on Work-Life balance in Data Science Professionals",
  "Are \"easy apply\" LinkedIn jobs even worth it?",
  "APIS GRATUITAS",
  "Linux for Data Science?",
  "How important is AI audit?",
  "Discouraged",
  "What non-coding books made you a better data scientist?",
  "Will Data Science jobs ever get an in-person component?",
  "With the advent of chatGPT and other advanced AI softwares to definitely come in the future, are data science jobs at risk? Will AI replace data scientist in the near future? If so, what precautions should prospective and current data scientists take?",
  "Product manager in small company?",
  "Cladograms",
  "How to get experience with Github",
  "Be careful with AI influencers marketing themself as data scientists or data experts",
  "How bad is your Company Data?",
  "How to learn “business”?",
  "End-to-End Pyspark and S3 Docker Compose Repo Setup",
  "Big data is dead - do you work with datasets that don't fit on a single machine?",
  "Data Scientist vs Business Analyst ?",
  "Selling and Implementing Data Science solutions to Non-Technical users.",
  "Stuck as a \"Data Analyst\", but only in name.",
  "Beginner tutorial for control version (git) from vs code official",
  "Meta internship",
  "Advice for changing career from software development to Data Science",
  "Are you just mediocre at your job?",
  "Programming skills for DS?",
  "Communication as a Data Scientist/Analyst",
  "What is a Data Scientist? A Data Science Approach to Defining a Data Scientist",
  "Does anyone know a package in python that will print correlations of multiple variables and p-values in matrix format?",
  "First few months of a data analyst job - what's your story? How long did it take you to get up to speed with the data structures?",
  "side gig for extra $$$?",
  "Performance reviews: \"Best practice\" vs what actually happens in reality",
  "Data science roadmap",
  "Need some help! How can I change contribution of variables in Bayesian model without changing the prior mean?",
  "How many interviews do you juggle at one time?",
  "Anyone have a large data set of medical records",
  "What are some common misconceptions about AI?",
  "Mid-Career DS Working Through Post-Layoff Anxiety",
  "From finance to data scientist How?",
  "is data science degree overrated?",
  "Where can i get data of financing on SMEs",
  "Correct way to display \"No data\" in graphs",
  "A Step-by-Step Tutorial - Quantum Deep Learning for Medical Datasets",
  "best laptop/ultrabook for studying data science / ai?",
  "where can i find good open source projects?",
  "How would you explain a logistic regression to someone who isn’t data-oriented (non-specialist)?",
  "dear non-tech background peeps, how did you land your first job in the industry?",
  "isn't this just too much for a take home assignment?",
  "Handling mislabeled tabular data with xgboost",
  "Statistical Test for Significance of One Hot Encoded Categories",
  "Want to do hands-on online courses? Which ones would you recommend?",
  "Data science in digital marketing",
  "Learning through online courses",
  "Minimum data points needed to calculate mean and variance",
  "Domain Knowledge!",
  "Data Science managers, what core skills (and to what depth of knowledge) are you looking for in a Data Scientist hire in 2023?",
  "Applying AI-Driven Differential Privacy to Data Science",
  "When does regularization come into play in Machine Learning?",
  "Data Science Jobs",
  "Visual data pipelining tools - KNIME datahaiku and competitors",
  "Who wants to help write the screen play?",
  "Starting a personalized mentorship group for data scientists",
  "Help!! Dataset required for Supervised Linear Regression | Learning purposes",
  "Udacity vs Coursera",
  "ML System Design/Case Study Preparation material",
  "Should I avoid MPS in data science and stick with only MS in DS/analytics?",
  "Collecting data...",
  "Weekly Entering & Transitioning - Thread 06 Feb, 2023 - 13 Feb, 2023",
  "Dynamic pricing in retail.",
  "What constitutes a data science project? Particularly data analysis.",
  "having trouble discerning what tests to use for evaluating these performance ratings",
  "Which field has more future: image recognition or electricity price forecasting?",
  "Difference between Bias and Variance (I only know about linear regression as of now)",
  "Thoughts on Google's Looker Studio",
  "Where can I find this macro-economics data?",
  "How many of you really work using control version like git rather than local files?",
  "Python or R for energy and environmental research",
  "I work as a reporting analyst, but my title is specialist. Which title should be on my linkedin profile ?",
  "Working with extremely limited data",
  "The Ultimate Guide to a Successful Career in Data Science",
  "Looking for open source projects in Machine Learning and Data Science.",
  "Personal Website to publish projects/portfolio",
  "Did a SQL assessment on TestDome today and I completely screwed it up. I don’t use subqueries on a day to day basis which was the focal point of the assessment.",
  "GitLab/GitHub survival kit for noobs",
  "Python Developer",
  "Machine Learning Development Services",
  "Master degree concern",
  "Expectations for Data Scientists, a very interesting perspective",
  "What are some of the top DS firms to intern out there? (US-based)",
  "Is it normal for data scientists to move to non technical roles as they move up?",
  "Have you ever been in a job where you didn’t know/couldn’t figure out what to do?",
  "How can I safely identify more positive examples in a text dataset?",
  "you need to be able to communicate well with other people?",
  "Do US based companies hire Data/Business analysts overseas?",
  "The difference between a Data Scientist and a Data Analyst.",
  "Completing Tasks before the finish date but manager says I'm slow?",
  "Techniques for estimating the impact of an event upon user satisfaction",
  "What can you do with 3 data points?",
  "Failed internship search in a difficult job market: Bad timing or is DS a bubble?",
  "Multivariate Outlier Detection in Python",
  "Data Collection Tool",
  "Do data scientists in the financial industry really get to do this cool stuff?",
  "Stuck on a feature engineering problem with missing data.",
  "How to distinguish between 3 linear regressions",
  "How do you democratize your data process?",
  "Can I start a data career without another degree?",
  "a placid island of ignorance in the midst of black seas of infinity",
  "RPA advice needed",
  "Technology Readiness Levels (TRL) in AI development",
  "Need help with MS SQL Server",
  "What practices/tools/platforms are best on documenting undergoing tests (AB tests, and etc.) and strategies?",
  "Has anyone got an example of training a foundational model using python?",
  "Start Object-Oriented Programming now",
  "8 Best Data Science, Machine Learning, and Deep Learning Courses with Certificates",
  "Anyone know why network science isn’t a more popular discipline?",
  "I need some perspective (related to the DS job market):",
  "How to process additional data",
  "Autonomous Driving Off-Road | Swaayatt Robots | Dense Fog",
  "How do I land a new data-scientist job?",
  "How did you get into datascience",
  "Staying up to date after graduation",
  "Need advice on how to proceed",
  "Finding Products Advertisement Videos",
  "NLP: naming topics",
  "Applying Graph Theory in Machine Learning problem?",
  "Any experience dealing with a non-technical manager?",
  "Most of the people giving advice on this sub are not Data Scientists.",
  "Are there Masters programs in AI that don't require letters of recommendation?",
  "Twitter API alternative?",
  "UT Masters in AI v. GT OMA v. an AI Cert",
  "ELI5: \"to pad the inputs on the right rather than the left.\"",
  "concerning coursera based colorado boulder ms degree in data science.",
  "Is This A Good Method for Weighting Varying Levels of Experience?",
  "If you're new to databases should you start with the book Database Design for Mere Mortals or SQL Queries for Mere Mortals or Head first with sql",
  "Actual Time Spent on Interview Take Home Assignments",
  "How to identify tasks in logs?",
  "Happiness and Meaning in What We Do",
  "The y-axis is R^2 and the x-axis is the 8 blocks on my task. The fit changes as more data collects for each block. I am trying to make an argument to reduce the number of blocks after a certain point. I know there is an analysis to tell me when change becomes stable but I can't remember.",
  "Can Data Science work flows follow agile? How do we handle EDA, when directions change on a weekly basis based on findings?",
  "NLP Project",
  "Please give data set recommendation",
  "MSE DS (Online) U Penn Admission Statistics",
  "Masters Elective Selection Advice",
  "Is IBM centered around just data science?",
  "BoyWithUke AI Animation",
  "DS Intern questions",
  "How do I sort this pivoted data by the organic column? Any help appreciated.",
  "Job Search strategy Question",
  "What else is left? Should I continue with my masters in DS?",
  "How best to spend an education stipend at work?",
  "When to use the quadratic formula to evaluate errors",
  "Is there any group or site where we can connect with Data Scientists and maybe have mock interviews?",
  "Entity Resolution With Skleabr",
  "Time Series Analysis",
  "Not so obvious tips and tricks",
  "Rob Donnelly (Arena, Instacart, Facebook) Teaches Applied Causal Inference",
  "How to identify time periods when one set of time series data has a peak at the same time as another set of simultanerous data is stable and has no peaks",
  "Transitioning from Product Management to Data Science. Anyone done that?",
  "[Question Asked Before Interview]",
  "how to land a job as a fresher?",
  "Are ML masters cash grabs by the uni? How do I evaluate how good the masters programs are?",
  "How to do market sizing?",
  "Seeking Inspiration for Deep Learning Chatbot Project: Ideas & Dataset Resources Needed",
  "Friday Coding Challenge",
  "Is cross_val_score function the same as the KFold loop method? Help please!",
  "Industry Literature on Market Basket Analysis Metrics",
  "How can time-series data be declared as stationery?",
  "Looking for consultants",
  "Resources to study and explore the field of Data Science",
  "Where do you choose the threshold for interpolation, smoothing, outlier detection methods ?",
  "Better interview questions?",
  "Is Machine Learning the Next Numerical Methods ?",
  "Is Data Science a good education path?",
  "Start a data analysis department",
  "Data librarians - anyone here one?",
  "Incompetence is unethical?",
  "Can you show a serverless architecture for ML Versioning, Data Drift, Model Drift using Databricks, MLFlow and Kubernetes ?",
  "Data-centric vs model-centric MLOps",
  "Software Developer to Data Analyst to Data Scientist without a university degree. Is it possible?",
  "Why does anyone do this?",
  "Do you cuss while at work?",
  "Optimal encoding for labelling of a target word",
  "Can AI predict the future?",
  "PC takes a long time to execute code, possibility to use a cloud/external device?",
  "Is Explainable Forecasting used in practice? Multivariate Forecast vs Univariate",
  "You don't need to wait for someone to tell you what to do",
  "Dilettante in search of guidance",
  "MIT Professional Education Applied Data Science Program Certificate",
  "how to merge mulriple xml files into single csv file?",
  "Advice on finding data",
  "Editing source data in modern toolsets, especially excel/powerBI",
  "NLP group by columns",
  "I built an open source platform to deploy computationally intensive Python functions as serverless jobs, with no timeouts",
  "I am leaving my current company",
  "Looking to do Northwestern Bootcamp in May",
  "Anyone have a European Masters?",
  "How does the Support Vector Machine algorithm handle self-learning?",
  "You're hired as the first DS on a large team, where do you start?",
  "How do I get into DS as an undergraduate with no research experience?",
  "I'm stuck",
  "contract Query",
  "Finding my first job as a data scientist.",
  "Is Sentiment Analysis project too basic for final year cse project?",
  "Exploding brain...",
  "I need some help to understand the point of a interview case for a Jr Data scientist",
  "DSA Climbing Stairs Leetcode Problem Solved",
  "Been asked to do a SQL assessment for a DS role, anyone had experience using TestDome to do this? Any guidance much appreciated!",
  "Torn between building a loyalty program App focused, either on strategic partnerships and cross-selling for businesses with overlapping customer bases or B) inclined towards data analytics to help small businesses grow and scale by making data-driven decisions.",
  "Data Scientist from Healthcare Sector, what are some of the high impact products you have delivered?",
  "Working on a construction safety startup using predictive analytics",
  "There goes my job",
  "Too many meetings for my Data Analyst job",
  "What next, after becoming a data scientist?",
  "IBM Data Science Certificate worth it?",
  "Hands-on practical beginners course for Data Science",
  "What’s your experience with working full time and working on your Masters?",
  "Python for Data Science: An Introduction | Power of Python for Data Science: A Comprehensive Guide",
  "Plot you DL metrics with just 3 lines of code - see my Github project",
  "Do I need a post-grad degree?",
  "How should you go about learning about SAP as a data scientist?",
  "Uber Analytics Test",
  "Has anyone tried the online MS in Data Science program at Merrimack College?",
  "I want to try doing some data science work as a trial to see how i like it. What sorts of data would be good for this",
  "Here’s How You Can Ace Your Data Scientist Job Interview",
  "Need Help",
  "Data science program comparison: UC Berkeley MIDS and Stanford Masters in biomedical informatics",
  "what is going on here??",
  "Opinion on Denodo?",
  "How to forecast sales for different product types and categories",
  "ADVICE FOR SWITCHING TO DATA SCIENCE",
  "Bio undergrad planning to double major with Data Science —> need advice",
  "How to tell what is causing false negatives?",
  "2023 Focused Analytics Solutions Team (FAST) Full-Time Associate Program – Data Science by JPMC",
  "How to create a minimal SaaS data science startup?",
  "I Got a Data Science Mentor for Data Analytics..",
  "how to choose the proper P-value, in my dataset all feature having P-value>0.05",
  "Interview with case study, what to expect?",
  "Made a Bad Mistake as Intern. How Can I Move Forward?",
  "Any tips for data engineering programming interviews?",
  "What are alternatives to box or violin plots to show the aggregated mean and distribution of multiple time series data over time, in case the time axis does not line up across measurements?",
  "Media Mix Modeling will be increasingly important in the future, but it has many hidden failure modes. What are ways you think MMMs are being used incorrectly?",
  "Is Computing Data science different from Data Science?",
  "Help with simple linear regression analysis",
  "Has anyone tried Brainstation/LighthouseLabs/springboard?",
  "Jupyter Notebook Aren’t Made for Sensitive Data Science",
  "Is Hierarchical Bayesian Modelling used in industry?",
  "let the data speak",
  "Any interesting algorithm that is not implemented in the major libraries?",
  "Data for non science peeps",
  "Text To MUSIC? Google Creates AI Bot That Writes Music Based on Text Descriptions...",
  "In your opinion, what makes the difference between a senior and junior data scientist?",
  "Validating a Gaussian Process model",
  "What is everyone's opinion on an MSc Data Science (Bioinformatics and Biological modeling) course?",
  "[P] What are all of the Improvements the recent neural network use?",
  "How easy is it to get a permanent work from home data science job?",
  "Ever asked to illegal things with data?",
  "How could AI replace your job?",
  "Interview Question Help - How do you identify if your classification algorithm for unbalanced classes has overfit?",
  "Open source UI for Bayesian Belief Network (BBN) Exploration",
  "Which resources did you find the most helpful for preparing for interviews during your job search?",
  "Most Accurate Algo For Predicting 1 Currency Vs Another By",
  "I need to determine the constant values of a function based on geometrical values",
  "Curious to hear everyone's approach here: how would you approach a task to analyse a document containing qualitative and quantitative data using data science methods?",
  "Is a second masters worth it?",
  "‎Learning from Machine Learning: Vincent Warmerdam: Calmcode, Open Source, Explosion, Data Science | Learning From Machine Learning #2 on Apple Podcasts",
  "Yann LeCun Hating on ChatGPT",
  "Is it worth overthinking which master's to select in my position?",
  "Clustering by engagement and by behavior",
  "I'm an analyst who works from home and barely works",
  "what are some good network analysis projects to work on?",
  "What do you think about my data pipeline system?",
  "AI-based assessment of cardiac allograft rejections",
  "Health Data Shocks with Strange Clots",
  "What social problems might machine learning be well-equipped to help solve?",
  "Government workers. How do you accomplish data analysis/visualization?",
  "Complete Overview Of Data Science!",
  "Burtch Works Survey Results: 2023 Data Science, Analytics & Data Engineering Hiring in Q1/Q2",
  "OSU Online MS Data Analytics?",
  "How to handle data with same timestamps but different observations?",
  "Knime",
  "Best looking portfolio projects?",
  "I like cs and economics",
  "What software/architecture do you use for big data?",
  "Experience with transformer networks used for sales forecasting in an e-commerce setting",
  "What is the variance of drawing cards from a deck",
  "Data Visualization Software",
  "Best skills/courses to fine tune on for Business Intelligence/Analytics roles",
  "Culture of \"heres how i made it\" posts/videos and unsolicited advice in DS field. Am i the only one who thinks dude, nobody asked?",
  "Classification model correction for interfering classes",
  "Snoop Dogg Giving a speech about Zombies | AI Animation",
  "Any DS freelancers or retome workers here?",
  "Do you think I have what it takes for a data science-related job? What should I work on?",
  "Data Science Project",
  "Adrift post layoffs",
  "Career progression for fledgling Data Scientists",
  "Leak Detection in Steam Trap through Acoustics/ Sound Files",
  "JP Morgan FAST Data Science Coding Interview",
  "\"Dirty\" data",
  "Generative AI models",
  "Remote/rural data science community?",
  "5 Best Ways to Optimize Database for Performance Improvement",
  "Where do I begin with freelancing, what is a good plan?",
  "Pandas Illustrated: The Visual Guide to Pandas",
  "Credit risk management book series by Tony Van Gestel",
  "Questions at Interviews",
  "Choosing between statistics and data science degree",
  "How to include product price as a feature of an ML model for demand forecasting?",
  "I just had an DS interview. I failed and I am glad",
  "How to choose the optimal K for KNN?",
  "Is this how it really works?",
  "Looking for recommended courses/certification (AI/DS related)",
  "Y’all, using no precautions whatsoever, I tripped LinkedIn’s anti-scraping measures. Lol",
  "Will developers get automated before Data Scientists/Modellers",
  "Okay to post about RESCINDED job offer on LinkedIn?",
  "OMG!! AI is replacing my job",
  "What could I do to transition to Data science career eventually",
  "Does anyone work at Samsung Ads?",
  "The K-Nearest Neighbors Algorithm for regression and classification",
  "I’m so lost.",
  "Question:",
  "Standardize data before feature engineering or after?",
  "Hi, we are starting a small beta test of our project",
  "Data Science masters program at UC Berkeley - job opportunities?",
  "AI - Containing an outbreak, regression with a neural network",
  "I've been reporting sales data at work. What else can I learn and apply?",
  "How long did it take you to learn R?",
  "question about early anomaly detection/predictive maintenance",
  "Is there a reason why scikit-learn's classification report doesn't output the number of predictions?",
  "Decision Tree/Rules Engine",
  "Please review my CV",
  "Recommended platforms for continuing education at an intermediate level?",
  "Google Sheets or MS Excel, which one do you prefer?",
  "What to expect in a case interview?",
  "Is Mike West (Logikbot) any good? Looking for advice before signing up",
  "Topics to prioritize learning",
  "Starting to job hunt but unsure about myself and the salaries; advice needed!",
  "Which laptops are you using personally for data science and ML and which specs do they have? Do you rely on a good GPU or you use cloud services?",
  "How to predict potential new riders by adding additional vehicles?",
  "Freelancing rate? usd/hr",
  "DALL-E, ChatGPT, etc. seem to defeat the purpose of developing and employing AI",
  "Data Science Workflow Tools - Primarily Using Python",
  "Which laptop would you recommend for data scientist / statistician?",
  "Looking for resources for rolling out DS as a 'Solo Data Scientist'",
  "Waittt What?",
  "Need help with SQLite",
  "PageRank Algorithm for Graph Databases",
  "what to do with duplicate rows in conjoint analvsis?",
  "Should I take the job?",
  "Code Nuts and Bolts of Chat GPT",
  "Data Integration Manager?",
  "Solo Data Scientists How Do you do MLOps?",
  "Weekly Entering & Transitioning - Thread 30 Jan, 2023 - 06 Feb, 2023",
  "Which type of industry should I work at as data analyst?",
  "How do I train a TTS model using WaveRNN?",
  "Life after the Google Data Analyst Certificate: SQL or Python?",
  "Trying to decide my timeline for resigning, multiple factors, please chime in!",
  "Would algorithmic trading experience and associated projects constitute 'relevant' experience when transitioning to DS?",
  "can somebody please point me to a good github repo for DS",
  "Senior Data Analyst interview today (Couple of Hours)",
  "Local Natural Language Processing",
  "Regression: Base rent and heating as a feature. Does it make sense to set rent including heating as the target?",
  "Understanding Similarity Measures for Text Analysis",
  "Asking for advice on master selection",
  "How do I combine DS with biology",
  "short courses for data science suggestions?",
  "GSheets automatic update.",
  "is full stack data scientist a term I should use?",
  "Open AI",
  "AI has designed bacteria-killing proteins from scratch – and they work",
  "PhD in process mining?",
  "What is the average salary of a Data scientist?",
  "Questions re: freelance DS work",
  "What are the most in demand skills of 2023?",
  "Python or R for simple Data Analysis and Visualization for a Bachelor Thesis",
  "Data science roadmaps and recs?",
  "Books for SQL as beginner for data analysis specifically",
  "Instructor told me I could sign up for and internship but I'm unqualified",
  "Should I enter this Data science field? if yes then how ?",
  "Is asking candidate (2 years experience) to code neural network from scratch on a live interview call a reasonable interview question?",
  "Difference in usecases for AWS Sagemaker vs Databricks?",
  "Hyperparams tuning w/ Bayesian optimization",
  "[D] Combining results from multiple test dataset",
  "job roles for freshers in the industry?",
  "What does Data Scientist do ?",
  "A new way to accelerate your data science workflow",
  "Industrial Case Study of GNNs with PyTorch Geometric for Document Understanding",
  "Book Recommendations for Network Graphs?",
  "Are there any good, practical Data Science \"Cookbook\" style books/materials? Ie with step by step instructions, code",
  "What test to use to test differences in proportions of total?",
  "Airport ridesharing data?",
  "Good resources for covering SVMs?",
  "Interview questions about kernel SVM",
  "Should I finish my economics degree asap or focus on learning DS?",
  "OMSCS in GaTech vs MS DS in UT Austin",
  "How to find a remote job in Data Science and Data Analytics?",
  "Looking from DS background for a side project",
  "For mathematicians/statisticians: besides calc/stats/linalg, what are the most important (or additive) foundational math courses for data science.",
  "Going for the MSI at UMSI",
  "Has anyone gotten a job with a data science certificate?",
  "3 Smart Steps to Junior Data Analyst/Scientist",
  "As a hiring manager - this, this right here",
  "Thoughts on bachelor degree in Data Science",
  "Seeking Feedback: How to Improve My Cheat Sheet for Beginners in Machine Learning Algorithms - Types, Applications, and Examples",
  "I created my first YouTube video about the Brief History of Data let me know what you guys think!",
  "Advice on Learning Pathway(s) and where personal interests intersect with DS",
  "Can keeping channels more than '3' in images crash CNNs?",
  "Stuck in the same project without results for a year",
  "hi guys require instagram dataset for building a hashtag generator for self learning. Please guide me from where I can get this. Thanks",
  "Python or R for my final year project?",
  "Data Scientists and Data Analysts: Do you ever use your knowledge and experience in your profession outside of your job?",
  "Is it possible to educate myself using online resources to get a job as a junior data scientist with no prior background in the field? If so, I would really appreciate any resource that can be shared. Thanks.",
  "A module my project depended on to retrieve data is obsolete. Still include project in portfolio?",
  "DS career doubt",
  "Creating Real-World AI Models by Newbies With ChatGPT",
  "Implementing GPTZero from scratch",
  "Does this field attract arrogant people?",
  "How to predict a series of events",
  "What are the major math/stats concepts do you need to master to be a good data scientist?",
  "Does anyone else worry they’ll forget all their maths/fundamentals?",
  "Why aren’t there many female DS?",
  "Are there any companies or startups cleaning and pre-processing data for bigger companies that eventually use them for analytics or ML? Want to know their name?",
  "10 Simple Things You Can Do to Improve Your Data Science Skills in 2023",
  "Anyone that have been working with causal models?",
  "Could missing data be considered an indicator for things within itself?",
  "Please help me with knowing about this syllabus of Probability and Statistics for Data Science.",
  "Renewable Energy or Data Science",
  "Predicting beer consumption using Machine Learning",
  "Suggestions on courses that can be completed in 6 months, just for KPI sake",
  "Do ALL data science jobs use machine learning? About what percentage of them do not use it?",
  "Data science conferences / meetings in UK",
  "what foreign language should i learn",
  "SQL for beginners",
  "I'm a tired of interviewing fresh graduates that don't know fundamentals.",
  "Linear Regression",
  "Others presenting my work",
  "Is this sub only for new grads, students, and career swaps?",
  "Is it worth to spend time in training and getting certified in UiPath as a Data Scientist?",
  "Opinion on Current Experience?",
  "A python module to generate optimized prompts, Prompt-engineering & solve different NLP problems using GPT-n (GPT-3, ChatGPT) based models and return structured python object for easy parsing",
  "Invited to On-Site Interview *after* \"Final\" Round",
  "Resources (books) for DA/interview",
  "In the R vs. Python discussion, where do you stand?",
  "What programming languages?",
  "Data science is a rapidly growing field that is revolutionizing the way we understand and make…",
  "Where to go outside of tech?",
  "⭕ What People Are Missing About Microsoft’s $10B Investment In OpenAI",
  "Is switching into data science or data analytics a bad idea?",
  "What’s everyone’s favorite data science conference in the US",
  "Tell me the coolest project/research you’ve worked on in your career, and the outcome of said project.",
  "Data scientist hiring managers, what is something you ask in an interview that makes or breaks the deal?",
  "MSc in Artificial Intelligence (with ML modules) /MSc in CS (with AI and ML modules) for a role as a data scientist",
  "Population Density and Household Income",
  "An interesting major project idea for college level related to data science?",
  "How to withdraw from job offer",
  "will openAI make data scientists obsolete?",
  "Street View House Number Digits Recognition Deep Learning CNN Model",
  "Learning Math by hand or with Python?",
  "Discount code for Dataquest (get $15 off)",
  "🚀Rodin: 3D Avatars Using Diffusion",
  "Starting to think DS isn’t worth it",
  "From zero to data science: How I taught myself Python and Pandas",
  "Evaluating Bayesian Optimisation search efficiency and uncertainty",
  "how to start in data science as a complete beginner",
  "How do I make more money?",
  "Help with World Quant University Data Science Lab",
  "How to predict Total Hours needed with List as Input?",
  "How often do you copy and paste code?",
  "Model strucuture selection - Help!",
  "Causality/network visualisations: recommendations",
  "Should I be learning data analysis now if my goal to become a data scientist/ AI engineer?",
  "Good online Looker course?",
  "Which major choice is best?",
  "Pursuing Data Science major, need tips for next steps!",
  "Has anyone transitioned a project from a relational DB to a graphDB and realised major improvements in performance or efficiency?",
  "Retail Data Scientists, if a product is not selling, how do you tell/model if it is out-of-stock or slow moving.",
  "K-means clusters as features for more complex models",
  "When would you choose to conduct a hypothesis test vs run a linear regression?",
  "Monte Carlo Simulation",
  "Quantum Machine Learning: An Advanced End-to-End Project Tutorial",
  "Low prevalence of user education/job mod tags.",
  "early anomaly detection on time series and additional static variables",
  "Categorizing groups of events in a transactional database",
  "What would you look for in a master's program?",
  "How to Explain Open Source != Security Issue",
  "Is data science just not a thing really? Like not a business reality in wide use?",
  "Intro to MLOps",
  "Buzz around new Deep Learning Models and Incorrect Usage of them.",
  "Senior data scientist, 8yrs experience in deep learning + MS Electrical Engr... What's next?",
  "From Market Research/Insights role to Data Analyst? Looking for advice",
  "What else is left? Should I continue with my masters in DS?",
  "Better interview questions?",
  "Classification model correction for interfering classes",
  "Career progression for fledgling Data Scientists",
  "Large Language Model",
  "Python or R for simple Data Analysis and Visualization for a Bachelor Thesis",
  "Local Natural Language Processing",
  "Do you want an easy and quick way to explain your image models?",
  "Is it normal in the data Science field to not have that many code checks?",
  "Senior data scientist, 8yrs experience in deep learning + MS Electrical Engr... What's next?",
  "Difficulties consuming AI API vendors like AWS Rekognition",
  "Can keeping channels more than '3' in images crash CNNs?",
  "🚀Tune-A-Video: One-Shot Tuning of Image Diffusion Models for Text-to-Video Generation",
  "GPT-4 Will Be 500x Smaller Than People Think - Here Is Why",
  "We used Stable Diffusion to create a game of image telephone that can de-identify images",
  "Creating a Machine Learning Library",
  "Transformer not converging because it cannot find EOS token"
]