[
  "[D] Large Language Models feasible to run on 32GB RAM / 8 GB VRAM / 24GB VRAM",
  "[R] Augmented Language Models: a Survey - Meta AI 2023",
  "[D] What are the worst ethical considerations of large language models?",
  "[R] RWKV-4 14B release (and ChatRWKV) - a surprisingly strong RNN Language Model",
  "[R] [N] Toolformer: Language Models Can Teach Themselves to Use Tools - paper by Meta AI Research",
  "[P] Extracting Causal Chains from Text Using Language Models",
  "[R] Holistic Evaluation of Language Models (HELM)",
  "[P] Understanding & Coding the Self-Attention Mechanism of Large Language Models",
  "The Inference Cost Of Search Disruption – Large Language Model Cost Analysis [D]",
  "[P] Understanding Large Language Models -- A Transformative Reading List",
  "[R] [P] Adding Conditional Control to Text-to-Image Diffusion Models. \"This paper presents ControlNet, an end-to-end neural network architecture that controls large image diffusion models (like Stable Diffusion) to learn task-specific input conditions.\" Example uses the Scribble ControlNet model.",
  "[D] What's the best way to capture a person's 3D likeness right now?",
  "[D] bounding box or instance segmentation",
  "[D] Is it legal to use images or videos with copyright to train a model?",
  "[D] CFG role in diffusion vs autoregressive transformers",
  "Automated sleep tracking + prediction [P]",
  "[D] Are there emergent abilities of image models?",
  "[R] Does a new published ML dataset always need to have an official train-dev-test split? Should the test set be made balanced?",
  "[Discussion] Computing the derivative of a diffusion model with respect to the prompt",
  "[N] [R] Google announces Dreamix: a model that generates videos when given a prompt and an input image/video.",
  "[D] Simple Questions Thread",
  "[D] Large Language Models feasible to run on 32GB RAM / 8 GB VRAM / 24GB VRAM",
  "[D] Does Layer Normalization compute statistics along spatial/ token axes?",
  "[D] Something basic I don't understand about Nerfs",
  "[R] neural cloth simulation",
  "[R] Workout Planner App",
  "Potential Jobs [P]",
  "[R] [N] In this paper, we show how a conversational model, 3.5x smaller than SOTA, can be optimized to outperform the baselines through Auxiliary Learning. Published in the ACL Anthology: \"Efficient Task-Oriented Dialogue Systems with Response Selection as an Auxiliary Task.\"",
  "[D] On papers forcing the use of GANs where it is not relevant",
  "[R] [N] Mastering Diverse Domains through World Models - DreamerV3 - Deepmind 2023 - First algorithm to collect diamonds in Minecraft from scratch without human data or curricula! Now with github links!",
  "[R] [P] Implementation of feature extraction and ID attribution for biometric identification project",
  "[R] Train CIFAR10 to 94% in 7 seconds or less (Lookahead with custom scheduling, CutMix, and more!)",
  "[R] Augmented Language Models: a Survey - Meta AI 2023",
  "[R] [N] Noise2Music - Diffusion models for generating high quality music audio from text prompts, by Google Research",
  "[D] Things you wish you knew before you started training on the cloud?",
  "[D] Toolformer implementation using only few-shot prompting",
  "TorchDrug tutorial [D]",
  "[D] Difference between [ Offsite-Tuning: Transfer Learning without Full Model ] and Federated learning?",
  "[P] Whisper-UI Update: You can now bulk-transcribe, save & search transcriptions with Streamlit & SQLAlchemy 2.0 [details in the comments]",
  "[D] Does langchain upload all user’s data to Openai?",
  "[D] bounding box or instance segmentation",
  "[R] difference between UAI and AISTATS ?",
  "[D] Any papers / articles that discusses the accuracy / usefulness of opensource LLMs?",
  "[D] CFG role in diffusion vs autoregressive transformers",
  "[D] what are some open problems in computer vision currently?",
  "[R] Any work on model-based RLHF?",
  "[D] Formalising information flow in NN",
  "[N] Google is increasing the price of every Colab Pro tier by 10X! Pro is 95 Euro and Pro+ is 433 Euro per month! Without notifying users!",
  "[D] Methodologies for tuning two or more unlinked classifier thresholds in tandem with custom losses?",
  "[P] No-Code AutoML Feature Importance, Baseline Modelling and Data visualisation PDF report generator, for any tabular and/or audio dataset",
  "[R] Universal Intelligence: A Definition of Machine Intelligence",
  "[Discussion] Time Series methods comparisons: XGBoost, MLForecast, Prophet, ARIMAX?",
  "[R] The Table Feature Transformation Library Release",
  "Automated sleep tracking + prediction [P]",
  "[D] Types of ML studies/papers",
  "[D] Short survey of optimization methods",
  "[D] accelerating likelihood computations of diffusion models",
  "[R] Does a new published ML dataset always need to have an official train-dev-test split? Should the test set be made balanced?",
  "[D] Is FP16 used in deep learning or FP32?",
  "[D] Bing: “I will not harm you unless you harm me first”",
  "[D] [R] What is your machine/deep learning research workflow?",
  "[R] Congruence between a neuron and a token (by Clement Neo and Joseph Miller)",
  "[D] Coauthor Paper?",
  "Efficient technique improves machine-learning models’ reliability",
  "[D] What are the worst ethical considerations of large language models?",
  "[D] Training networks on extremely large datasets (10+TB)?",
  "[D] HuggingFace considered harmful to the community. /rant",
  "[R] Looking for papers which are modified variational autoencoder (VAE)",
  "[D] Compare open source LLMs",
  "[R] RWKV-4 14B release (and ChatRWKV) - a surprisingly strong RNN Language Model",
  "[D] GLM 130B (Chinese-English Bilingual model) translations vs Google, Deepl Translate, NLLB and chatGPT",
  "[P] Data scraping journal publications",
  "[D] Lion , An Optimizer That Outperforms Adam - Symbolic Discovery of Optimization Algorithms",
  "[D][P] Is anyone else playing with personalized LLMs?",
  "[P] Build data web apps in Jupyter Notebook with Python only",
  "[R] Event-based Backpropagation for Analog Neuromorphic Hardware",
  "[D] Is anyone working on ML models that infer and train at the same time?",
  "[D] Variation in accuracy of predicted noise term in diffusion model as a function of timestep?",
  "[P] Pytorch seeding and independent RNG streams",
  "[R] Experiences and opinions on TMLR?",
  "[D] Tensorflow struggles",
  "[R] Zeno: An Interactive Framework for Behavioral Evaluation of Machine Learning",
  "[R] Hitchhiker’s Guide to Super-Resolution: Introduction and Recent Advances",
  "[R] [N] REaLTabFormer: Generating Realistic Relational and Tabular Data using Transformers",
  "[R] Scaling Vision Transformers to 22 Billion Parameters",
  "[D] What is the fastest framework for LLM conditional generation?",
  "[D] CBAM with YOLOv7?",
  "[D] Retrieval transformers with learnable queries?",
  "[D] Repeating important samples in every batch for NN training?",
  "[Discussion] Computing the derivative of a diffusion model with respect to the prompt",
  "[R] Actually useful every day application of a Gaussian Process",
  "[D] A Comprehensive Guide & Hand-Curated Resource List for Prompt Engineering and LLMs on Github",
  "[D] Noam Brown, FAIR: On achieving human-level performance in poker and Diplomacy, and the power of spending compute at inference time",
  "[P] Free GPT3-based tool to suggest terminal commands via natural language",
  "[D] Looking for advice on model architecture for embedding facial landmark coordinates into StyleGAN2 latentspace",
  "[R] Boosted Trees Literature",
  "[N] Miniworld is now a mature project within the Farama Foundation",
  "[R] [P] LUCAS: LUng CAncer Screening dataset",
  "[R] Imagenet 2015 VID Dataset",
  "[D] self supervised learning for regression with tabular numerical data",
  "[D] What are your tricks/infra working with embeddings?",
  "[D] Anyone interested in training an AI for Tigris and Euphrates?",
  "[R] What are some papers that describe TikTok's algorithm?",
  "[D] Threshold for k-means anomaly detection",
  "[R] [N] Toolformer: Language Models Can Teach Themselves to Use Tools - paper by Meta AI Research",
  "[Discussion] The need for noise in stable diffusion",
  "[D] Quality of posts in this sub going down",
  "[D] What are the best ways to make and run a fast custom TTS?",
  "[R] [N] pix2pix-zero - Zero-shot Image-to-Image Translation",
  "[D] Is a non-SOTA paper still good to publish if it has an interesting method that does have strong improvements over baselines (read text for more context)? Are there good examples of this kind of work being published?",
  "[R] Understanding metric-related pitfalls in image analysis validation",
  "[R] CIFAR10 in <8 seconds on an A100 (new architecture!)",
  "[R] [P] OpenAssistant is a fully open-source chat-based assistant that understands tasks, can interact with third-party systems, and retrieve information dynamically to do so.",
  "[Discussion] are there any survey on compute required to train large DNN models ?",
  "[P] Extracting Causal Chains from Text Using Language Models",
  "[D] What ML dev tools do you wish you'd discovered earlier?",
  "[R] [P] Adding Conditional Control to Text-to-Image Diffusion Models. \"This paper presents ControlNet, an end-to-end neural network architecture that controls large image diffusion models (like Stable Diffusion) to learn task-specific input conditions.\" Example uses the Scribble ControlNet model.",
  "[D] Cloud agnostic framework to avoid hyperscaler SDK lock-in?",
  "[D] Engineering interviews at Anthropic AI?",
  "[R] DIGIFACE-1M — synthetic dataset with one million images for face recognition",
  "[D] Incorporating \"No Maintenance\" Examples into a Maintenance Dataset in ML",
  "[D] Diffusion Model Reverse Process Questions",
  "[R] Holistic Evaluation of Language Models (HELM)",
  "[P]OneFlow v0.9.0 Came Out!",
  "[P] Introducing arxivGPT: chrome extension that summarizes arxived research papers using chatGPT",
  "[D] Have their been any attempts to create a programming language specifically for machine learning?",
  "[D] Getting LLMs to explore their latent spaces",
  "[P] Understanding & Coding the Self-Attention Mechanism of Large Language Models",
  "[D] Bert Tokenization: Replacing person/entity names with a common token/word.",
  "[P] I Made an App That Simplifies Text Data Labeling: DataLabel",
  "[R] The Naughtyformer: A Transformer Understands Offensive Humor",
  "[D] Can Google sue OpenAI for using the Transformer in their products?",
  "[R] [ICLR'2023🌟]: Vision-and-Language Framework for Open-Vocabulary Object Detection",
  "[P] Understanding Large Language Models -- A Transformative Reading List",
  "[P] I'm using Instruct GPT to show anti-clickbait summaries on youtube videos",
  "The Inference Cost Of Search Disruption – Large Language Model Cost Analysis [D]",
  "[D] Effectiveness of CoordConv",
  "[R] Large Language Models Can Teach Themselves to Use Tools",
  "[N] New Frontiers in Artificial Intelligence",
  "[R] UniD3: Unified Discrete Diffusion for Simultaneous Vision-Language Generation",
  "[News] Researchers at Brigham Young University created an AI system to reduce time spent on film studies for NFL teams. It uses deep learning and computer vision to analyze and annotate game footage, with over 90% accuracy on player detection and 85% accuracy in determining formations.",
  "[D] Transformers for poker bot",
  "[D] Hierarchical Clustering - Transforming the Distance Axis",
  "[D] Best available text to speech free AI model out there for english",
  "[D] Locally-runnable text to speech AI?",
  "[D] What ML or ML-powered projects are you currently building?",
  "[D] Is it legal to use images or videos with copyright to train a model?",
  "[P] I'm using Deep Learning to play Old School game, Snake Game",
  "[D] Critique of statistics research from machine learning perspectives (and vice versa)?",
  "[D] Is Efficient-Net same as MobileNetV2",
  "[D] Speed up HuggingFace Inference Pipeline",
  "[Discussion] WASM equivalant to Gradio but without needing a server?",
  "[D] Using LLMs as decision engines",
  "[P] Resume parsing + Cv analysis",
  "[D] Simulator for RL problems",
  "[P] Did anyone manage to run the MusicLM implementation from lucidrains?",
  "[D] numbers of parameters that can affect on a model.",
  "[D] Experiences finding a job in the US as a Mexican currently working in the UK",
  "[P] Get 2x Faster Transcriptions with OpenAI Whisper Large on Kernl",
  "[D] Are there emergent abilities of image models?",
  "[R] Research Seminar by Neural Magic: AC/DC: Alternating Compressed/DeCompressed Training of Deep Neural Networks",
  "[D] Constrained Optimization in Deep Learning",
  "[D] Story-telling AI that I could feed data to and then ask to write a similar replica?",
  "[D] Latent spaces and weather forecasting/nowcasting",
  "[D] The Kaggle Book : Book by Konrad Banachewicz and Luca Massaron",
  "[D] Should I put my current or past affiliation on my EACL paper?",
  "[D] RTX 3090 with i7 7700k, training bottleneck",
  "[D] Are there any AI model that I can use to improve very bad quality sound recording? Removing noise and improving overall quality",
  "[D] Simple tensorflow model predict question",
  "[R] Theory of Mind May Have Spontaneously Emerged in Large Language Models",
  "Have you seen ruber slicing? [D]",
  "[R] pix2pixzero - Zero-shot Image-to-Image Translation",
  "[D] Plot Best Run for Accuracy or Mean across runs?",
  "[D] Dense correspondence between image/mesh",
  "[Discussion] Looking for opinions: Scale Spellbook vs. Snorkel Flow vs....?",
  "[P] Creating an embedding from a CNN",
  "[D] Bees: a new unit of measurement for ML model size",
  "[PROJECT] Text cluster of MxN dimensions as training set for AI?",
  "[D] Can we use Ray for distributed training on vertex ai ? Can someone provide me examples for the same ? Also which dataframe libraries you guys used for training machine learning models on huge datasets (100 gb+) (because pandas can't handle huge data).",
  "[D] Hugging face model",
  "[D] Similarity b/w two vectors",
  "[D] Format for ICML tutorial submission?",
  "[N] Getty Images Claims Stable Diffusion Has Stolen 12 Million Copyrighted Images, Demands $150,000 For Each Image",
  "[D] List of RL Papers",
  "[Discussion] Cognitive science inspired AI research",
  "[N] New Book on Synthetic Data​: Version 3.0 Just Released",
  "[N] Microsoft announces new \"next-generation\" LLM, will be integrated with Bing and Edge",
  "[P] Scripts/Programs to collect Baseline Logs",
  "[D] Which is the fastest and lightweight ultra realistic TTS for real-time voice cloning?",
  "[N] Google: An Important Next Step On Our AI Journey",
  "[N] Beyond Transformers with PyNeuraLogic",
  "[P] Best way to add a sampling step within a neural network end-to-end?",
  "[Project] I used a new ML algo called \"AnimeSR\" to restore the Cowboy Bebop movie and up rez it to full 4K. Here's a link to the end result - honestly think it looks amazing! (Video and Model link in post)",
  "[D] Image object detection, but for 1 dimensional data?",
  "[P] ChatGPT without size limits: upload any pdf and apply any prompt to it",
  "[N] Getty Images sues AI art generator Stable Diffusion in the US for copyright infringement",
  "[D] Multi-class classifications when a few of the classes are not mutually-exclusive",
  "[Discussion] Best practices for taking deep learning models to bare metal MCUs",
  "[D] Can output time frame cover input time frame in machine learning?",
  "Model/paper ideas: reinforcement learning with a deterministic environment [D]",
  "[D] Papers that inject embeddings into LMs",
  "[P] Pythae 0.1.0 is out and supports distributed training for 25 Variational Autoencoders",
  "[D] Name your favourite Github repositories for data scientists",
  "[D] Artificial Intelligence for Manufacturing",
  "[Discussion] Can an AMD Ryzen 5 3400G computer with 16GB of RAM effectively train an AI model?",
  "[D] question on first time training a model",
  "[Discussion] Is ChatGPT and/or OpenAI really the leader in the space?",
  "[D] A ML-powered music description/tag generator? (a reverse-MusicML)?",
  "[D] Selecting a \"stable\" set of hyperparameters",
  "[P] I made a browser extension that uses ChatGPT to answer every StackOverflow question",
  "[R] [D] PADL: Language-Directed Physics-Based Character Control by NVIDIA",
  "[P] Forecasting methods in Time Series",
  "[D] Is it possible to serve an facebook/opt-iml-1.3b locally?",
  "[R] Research trends in Graph Neural Networks (GNN)",
  "[R] Creating a Large Language Model of a Philosopher",
  "[D] What techniques can I use to tell if a problem is likely enough to be solved by ML so as to justify compiling the dataset?",
  "[D] Yann Lecun seems to be very petty against ChatGPT",
  "[P] I made image clustering and captioning tools",
  "Does the high dimensionality of AI systems that model the real world tell us something about the abstract space of ideas? [D]",
  "[D] List of Large Language Models to play with.",
  "[R] deep learning and session-specific rapid recalibration for dynamic hand gesture recognition from EMG",
  "[R] [D] The New XOR Problem",
  "High-speed cameras and deep learning [Research]",
  "[D] Overview of of Chatbot Research?",
  "Which strategies,framework and applications tools can be implement to automatically monitor the health of the machine learning model? [D]",
  "[D] AtheneWins just showcased an AI streamer bot, Does anyone know how he did this?",
  "[N] [R] Google announces Dreamix: a model that generates videos when given a prompt and an input image/video.",
  "[D] Open Source Implementation of Dialogue LLMs like ChatGPT with Reinforcement Learning from Human Feedback?",
  "Wouldn’t it be a good idea to bring a more energy efficient language into the ML world to reduce the insane costs a bit?[D]",
  "[R] BLIP-2: Bootstrapping Language-Image Pre-training with Frozen Image Encoders and Large Language Models",
  "[D] Large language models (LLM) as priority / conflict resolver for embodied AI or in general",
  "[D] Comic book reader with speech balloon zooming",
  "[R] AudioLDM: Text-to-Audio Generation with Latent Diffusion Models",
  "[P] Interactive Map of NeurIPS Proceedings 1987-2022",
  "[D] Is there a database of English language tokens, including all dictionary words and common word segments?",
  "[N] \"I got access to Google LaMDA, the Chatbot that was so realistic that one Google engineer thought it was conscious. First impressions\"",
  "[P] We made an open source platform for machine learning and data monitoring",
  "[P] I made a browser extension that remove link Google Search Console",
  "[P] I made CoPilot for writing LaTeX (in Overleaf) - what do you think?",
  "[D] Generate Knowledge Graphs from Unstructured Texts with GPT-3!",
  "[R] Can anyone direct me to academic sources arguing that Big Tech using AI for targeted Social Media ads is a good thing for actual users?",
  "[D] RNN and S4 etc",
  "Objects Color Matching against a Reference Standard (ColorCODEX)? [D]",
  "[R] Grounding Language Models to Images for Multimodal Generation",
  "[P] Using an Image Regression Model to Guide Stable Diffusion Inference.",
  "[D] Does the M2 Max 30-core GPU have any advantage over M2 Pro 19-core GPU in Machine Learning Tasks?",
  "[N] GitHub CEO on why open source developers should be exempt from the EU’s AI Act",
  "[D] Is English the optimal language to train NLP models on?",
  "[P] Specific questions about programming an Artificial Inteligence",
  "Any games that use real AI system for the bots? [D]",
  "[R] 3D aware image synthesis with a spherical background — BALLGAN",
  "[D] Local GUI for Custom TTS Learning?",
  "[D] GNN Is node information required ?",
  "[P] I trained an AI model on 120M+ songs from iTunes",
  "[D] Could you use SVD for supervised learning?",
  "[P] Developing an artificial Intelligence",
  "[R] Multimodal Chain-of-Thought Reasoning in Language Models - Amazon Web Services Zhuosheng Zhang et al - Outperforms GPT-3.5 by 16% (75%->91%) and surpasses human performance on ScienceQA while having less than 1B params!",
  "What text to speech does this guy use? [R]",
  "[N] FT: Google invests $300mn in artificial intelligence start-up Anthropic",
  "Information Retrieval book recommendations? [D]",
  "[R] Chinchilla data-optimal scaling laws: In plain English",
  "[P] NLP Q&A Bot Project Guidance",
  "[R] Coinductive guide to inductive transformer heads",
  "[D] Purchasing Google Colab Pro",
  "[P] What tools are available for labelling data for LayoutLMv3?",
  "[N] Google Open Sources Vizier, Hyperparameter + Blackbox Optimization Service at Scale",
  "[Project] ideas NLP",
  "[D] Understanding Vision Transformer (ViT) - What are the prerequisites?",
  "[R] Topologically evolving new self-modifying multi-task learning algorithms",
  "[R] What’s your suggestion for offline RL?",
  "please help a bunch of students?(with pre annotated data set) we were assigned to this task with no prior knowledge of ML i don't know where to begin with we tried a couple of method which ultimately failed id be thankful for anyone who would tell me in steps what to do with this data[D]",
  "[R] Graph Mixer Networks",
  "[D] Are large language models dangerous?",
  "[N] Microsoft integrates GPT 3.5 into Teams",
  "[P] Any thoughts on the possibility of machine learning to retrofit HVAC in buildings?",
  "[D] Topic extraction to simplify news articles",
  "[D] Using a public research dataset for \"testing\" NOT \"training\" a ML model",
  "[p] I built an open source platform to deploy computationally intensive Python functions as serverless jobs, with no timeouts",
  "[Project] I built a minimal stateless ML project template built on my current favourite stack",
  "[D] Get log probs of a sentence using OpenAI APIs?",
  "[D] Why do LLMs like InstructGPT and LLM use RL to instead of supervised learning to learn from the user-ranked examples?",
  "[R] [P] Noisy Sentences Dataset",
  "[R] editing colors on SHAP plot summary",
  "[p] Is it possible to add more classes to an already trained resnet image classifier model without the need to retrain it in all dataset again? [p]",
  "[d]? Is there a way to access youtube alphabetically or by id?",
  "[P] [R] A simplistic UI to edit images with Stable Diffusion and InstructPix2Pix",
  "[D] Querying with multiple vectors during embedding nearest neighbor search?",
  "[R] Extracting Training Data from Diffusion Models",
  "[D] Commercial Use of a Model that has been trained using Human3.6M",
  "[P] Domestic Violence Dataset",
  "[D] ImageNet normalization vs [-1, 1] normalization",
  "[N] OpenAI starts selling subscriptions to its ChatGPT bot",
  "[D] Global Optimum of K-Means Cost Function",
  "[P] Time series outlier / anomaly detection",
  "[D]How Will Open Source Alternatives Compete With GPT3?",
  "[D] Apple's ane-transformers - experiences?",
  "[D] Do high leverage points affect Neural Net and Tree-based model?",
  "[D] What does a DL role look like in ten years?",
  "[R] On the Expressive Power of Geometric Graph Neural Networks",
  "[D] Why is stable diffusion much smaller than predecessors?",
  "[D] Normalizing Flows in 2023?"
]